# Напишіть программу "Касир в кінотеатрі", яка буде виконувати наступне:
# Попросіть користувача ввести свій вік (можно використати константу або функцію input()).
# - якщо користувачу менше 7 - вивести "Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Це фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Покажіть пенсійне посвідчення!"
# - якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років, всі можливі варіанти!) - вивести "Який цікавий вік!"
# - у будь-якому іншому випадку - вивести "А білетів вже немає!"

while True:
    age = input("Вкажіть ваш вік: ")
    if not age:
        print("Ви не вказали ваш вік :(")
    else:
        break

if int(age) > 10 and age[0] == age[-1]:
    print("Який цікавий вік!")

age = int(age)

if age < 7:
    print("Де твої батьки?")

elif age < 16:
    print("Це фільм для дорослих!")

elif age >= 65:
    print("Покажіть пенсійне посвідчення!")

else:
    print("А білетів вже немає!")
